MT Provision Plan

Terraform will perform the following actions:

  # module.aws.aws_ssm_parameter.main_group["CHAT_WORKFLOW_SID"] must be replaced
-/+ resource "aws_ssm_parameter" "main_group" {
      ~ arn            = "arn:aws:ssm:us-east-1:712893914485:parameter/PROD_TWILIO_MT_CHAT_WORKFLOW_SID" -> (known after apply)
      ~ data_type      = "text" -> (known after apply)
      ~ description    = "Twilio account - Chat transfer workflow SID" -> (known after apply)
      ~ id             = "PROD_TWILIO_MT_CHAT_WORKFLOW_SID" -> (known after apply)
      + insecure_value = (known after apply)
      ~ key_id         = "alias/aws/ssm" -> (known after apply)
      ~ name           = "PROD_TWILIO_MT_CHAT_WORKFLOW_SID" # forces replacement -> (known after apply) # forces replacement
      - tags           = {} -> null
      ~ tags_all       = {} -> (known after apply)
      ~ tier           = "Standard" -> (known after apply)
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["SURVEY_WORKFLOW_SID"] must be replaced
-/+ resource "aws_ssm_parameter" "main_group" {
      ~ arn            = "arn:aws:ssm:us-east-1:712893914485:parameter/PROD_TWILIO_MT_SURVEY_WORKFLOW_SID" -> (known after apply)
      ~ data_type      = "text" -> (known after apply)
      ~ description    = "Twilio account - Survey Workflow SID" -> (known after apply)
      ~ id             = "PROD_TWILIO_MT_SURVEY_WORKFLOW_SID" -> (known after apply)
      + insecure_value = (known after apply)
      ~ key_id         = "alias/aws/ssm" -> (known after apply)
      ~ name           = "PROD_TWILIO_MT_SURVEY_WORKFLOW_SID" # forces replacement -> (known after apply) # forces replacement
      - tags           = {} -> null
      ~ tags_all       = {} -> (known after apply)
      ~ tier           = "Standard" -> (known after apply)
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.aws.aws_ssm_parameter.twilio_chat_workflow_sid will be updated in-place
  ~ resource "aws_ssm_parameter" "twilio_chat_workflow_sid" {
        id             = "/production/twilio/AC7854f6126459347434a8e659295ebb79/chat_workflow_sid"
      + insecure_value = (known after apply)
        name           = "/production/twilio/AC7854f6126459347434a8e659295ebb79/chat_workflow_sid"
        tags           = {
            "Environment" = "production"
            "Name"        = "/production/twilio/AC7854f6126459347434a8e659295ebb79/chat_workflow_sid"
            "Terraform"   = "true"
        }
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.twilio_conversations_chat_transfer_workflow_sid will be updated in-place
  ~ resource "aws_ssm_parameter" "twilio_conversations_chat_transfer_workflow_sid" {
        id             = "/production/twilio/AC7854f6126459347434a8e659295ebb79/conversations_chat_transfer_workflow_sid"
      + insecure_value = (known after apply)
        name           = "/production/twilio/AC7854f6126459347434a8e659295ebb79/conversations_chat_transfer_workflow_sid"
        tags           = {
            "Environment" = "production"
            "Name"        = "/production/twilio/AC7854f6126459347434a8e659295ebb79/conversations_chat_transfer_workflow_sid"
            "Terraform"   = "true"
        }
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.twilio_survey_workflow_sid will be updated in-place
  ~ resource "aws_ssm_parameter" "twilio_survey_workflow_sid" {
        id             = "/production/twilio/AC7854f6126459347434a8e659295ebb79/survey_workflow_sid"
      + insecure_value = (known after apply)
        name           = "/production/twilio/AC7854f6126459347434a8e659295ebb79/survey_workflow_sid"
        tags           = {
            "Environment" = "production"
            "Name"        = "/production/twilio/AC7854f6126459347434a8e659295ebb79/survey_workflow_sid"
            "Terraform"   = "true"
        }
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_workflows_v1.workflow["master"] will be updated in-place
  ~ resource "twilio_taskrouter_workspaces_workflows_v1" "workflow" {
      ~ configuration            = jsonencode(
          ~ {
              ~ task_routing = {
                  ~ filters = [
                        {
                            expression           = "channelType=='web' AND e2eTestMode=='true'"
                            filter_friendly_name = "E2E Test"
                            targets              = [
                                {
                                    expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                    queue      = "WQe25a14d37ad627f1b464778da97e3383"
                                },
                            ]
                        },
                      ~ {
                          ~ expression           = "(channelType =='web' AND preEngagementData.location == 'https://kellimni.com/')" -> "(channelType =='web' AND preEngagementData.location == 'https://kellimni.com/') OR channelType =='whatsapp'"
                            # (2 unchanged attributes hidden)
                        },
                      ~ {
                          ~ expression           = "(channelType =='web' AND preEngagementData.location == 'https://empoweringchildren.gov.mt/')" -> "(channelType =='web' AND preEngagementData.location == 'https://empoweringchildren.gov.mt/') OR channelType =='whatsapp'"
                            # (2 unchanged attributes hidden)
                        },
                        {
                            expression           = "channelType =='web'  OR isContactlessTask == true OR  twilioNumber IN ['instagram:17841400289612325', 'messenger:325981127456443', 'whatsapp:+15077097720']"
                            filter_friendly_name = "Unknown Location or Not Web"
                            targets              = [
                                {
                                    expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                    queue      = "WQ811f59c3c6f6524d0e0abfe30de306f6"
                                },
                            ]
                        },
                    ]
                }
            }
        )
        id                       = "WS4c6a775baa64106edb1163db23fee1f3/WW62ae68dcb96697d39ce61232ceafae9e"
        # (4 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_workflows_v1.workflow["queue_transfers"] will be created
  + resource "twilio_taskrouter_workspaces_workflows_v1" "workflow" {
      + assignment_callback_url          = (known after apply)
      + configuration                    = jsonencode(
            {
              + task_routing = {
                  + filters = [
                      + {
                          + expression           = "transferTargetType == 'queue' AND targetSid == 'WQe25a14d37ad627f1b464778da97e3383'"
                          + filter_friendly_name = "e2e_test"
                          + targets              = [
                              + {
                                  + expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  + queue      = "WQe25a14d37ad627f1b464778da97e3383"
                                },
                            ]
                        },
                      + {
                          + expression           = "transferTargetType == 'queue' AND targetSid == 'WQ846dfabd6f616c022d33c382b4b7e2ae'"
                          + filter_friendly_name = "ecpm"
                          + targets              = [
                              + {
                                  + expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  + queue      = "WQ846dfabd6f616c022d33c382b4b7e2ae"
                                },
                            ]
                        },
                      + {
                          + expression           = "transferTargetType == 'queue' AND targetSid == 'WQ811f59c3c6f6524d0e0abfe30de306f6'"
                          + filter_friendly_name = "master"
                          + targets              = [
                              + {
                                  + expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  + queue      = "WQ811f59c3c6f6524d0e0abfe30de306f6"
                                },
                            ]
                        },
                      + {
                          + expression           = "transferTargetType == 'queue' AND targetSid == 'WQ28c9d048010bb705dac080cbf30a89df'"
                          + filter_friendly_name = "survey"
                          + targets              = [
                              + {
                                  + expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  + queue      = "WQ811f59c3c6f6524d0e0abfe30de306f6"
                                },
                            ]
                        },
                    ]
                }
            }
        )
      + fallback_assignment_callback_url = (known after apply)
      + friendly_name                    = "Queue Transfers Workflow"
      + id                               = (known after apply)
      + re_evaluate_tasks                = (known after apply)
      + sid                              = (known after apply)
      + task_reservation_timeout         = (known after apply)
      + workspace_sid                    = "WS4c6a775baa64106edb1163db23fee1f3"
    }

  # module.taskRouter.twilio_taskrouter_workspaces_workflows_v1.workflow["survey"] will be updated in-place
  ~ resource "twilio_taskrouter_workspaces_workflows_v1" "workflow" {
      ~ configuration            = jsonencode( # whitespace changes
            {
                task_routing = {
                    filters = [
                        {
                            expression           = "isChatCaptureControl==true"
                            filter_friendly_name = "CaptureChannel"
                            targets              = [
                                {
                                    queue = "WQ28c9d048010bb705dac080cbf30a89df"
                                },
                            ]
                        },
                    ]
                }
            }
        )
        id                       = "WS4c6a775baa64106edb1163db23fee1f3/WW8a00a16f7de6b5936e1943821e6c4072"
        # (4 unchanged attributes hidden)
    }

Plan: 3 to add, 5 to change, 2 to destroy.

Changes to Outputs:
  ~ task_router_master_workflow_sid       = "WW62ae68dcb96697d39ce61232ceafae9e" -> (known after apply)
  ~ task_router_workflow_sids             = {
      ~ master          = "WW62ae68dcb96697d39ce61232ceafae9e" -> (known after apply)
      + queue_transfers = (known after apply)
      ~ survey          = "WW8a00a16f7de6b5936e1943821e6c4072" -> (known after apply)
    }